IDEA Open Model
CombiInputSIA Class
Compatible with IDEA StatiCa 20.1
 Combination according to SIA in the model
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Loading.CombiInput
 IdeaRS.OpenModel.Loading.CombiInputSIA
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class CombiInputSIA : CombiInput
Public Class CombiInputSIA
	Inherits CombiInput
The CombiInputSIA type exposes the following members.
Constructors
Name | Description
CombiInputSIA
 Constructor
Top
Properties
Name | Description
Description
 Additional info
 (Inherited from CombiInput.)
Id
 Element Id
 (Inherited from OpenElementId.)
Items
 Combi Items in combination
 (Inherited from CombiInput.)
Name
 Name of combination
 (Inherited from CombiInput.)
TypeCalculationCombi
 Type of combination
TypeCombiSIA
 Type of EC combination
Top
See Also
Reference
IdeaRS.OpenModel.Loading Namespace